function ReturnTeleportLocations(cont)
if cont == "KA" then
  return {
    ["Калимдор Столицы"] = {
      ["Дарнасс"] = ".go 9978.111328 2036 1328.065674 1",
      ["Экзодар "] = ".go -3816.96 -11478.1 -138.462 530",
      ["Оргриммар "] = ".go 1403.081177 -4367.187988 25.235533 1",
      ["Громовой Утес"] = ".go -1056.809448 -239.941910 159.030350 1",
    },
    ["Калимдор Территории"] = {
      ["Тельдрассил"] = ".go 9477.19 1005.74 1249.01 1",
    	["Остров Кровавой Дымки"] = ".go -1785.28 -11611 35.4213 530",
    	["Остров Лазурной Дымки"] = ".go -4183.3 -12515 44.377 530",
    	["Зимние Ключи"] = ".go 6908 -4138 700 1",
    	["Лунная поляна"] = ".go 7508 -2907 465 1",
    	["Темные берега"] = ".go 7248 -329 20 1",
    	["Оскверненный лес"] = ".go 5962 -1005 415 1",
    	["Гора Хиджал"] = ".go 4654 -2967 1080 1",
    	["Азшара"] = ".go 3475 -5292 95 1",
    	["Ясеневый лес"] = ".go 2354 -1596 130 1",
    	["Дуротара"] = ".go 204 -4634 25 1",
    	["Северные степи"] = ".go -346 -2763 95 1",
    	["Южные степи"] = ".go -1996 -2311 95 1",
    	["Когтистые горы"] = ".go 908 240 25 1",
    	["Пылевые топи"] = ".go -3782 -3830 45 1",
    	["Мулгор"] = ".go -1859 -309 0 1",
    	["Пустоши"] = ".go -1457 1702 65 1",
    	["Тысяча Игл"] = ".go -5138 -1992 90 1",
    	["Фералас"] = ".go -4134 1522 240 1",
    	["Танарис"] = ".go -8375 -3284 16 1",
    	["Кратер Ун\'Горо"] = ".go -7501 -1340 -270 1",
    	["Силитус"] = ".go -7565 975 5 1",
    	["Ульдум"] = ".go -9869 -397 125 1",
    	["Ан\'Кираж"] = ".go -9046 1702 25 1",
    },
    ["Калимдор Подземелья"] = {
      ["Огненная Пропасть"] = ".go 1.784903 -14.368461 -17.553291 389",
      ["Пещеры Стенаний"] = ".go -160.004120 131.63653 -74.079254 43",
      ["Непроглядная Пучина"] = ".go -152.983551 106.329994 -40.095310 48",
      ["Лабиринты Иглошкурых"] = ".go 1941.789551 1543.693604 81.661453 47",
      ["Курганы Иглошкурых"] = ".go 2591.989502 1101.246460 51.859333 129",
      ["Зул\'Фаррак"] = ".go 1221.820557 840.745728 8.976474 209",
      ["Мародон"] = ".go 1019.69 -458.31 -43.43 349",
      ["Забытый город"] = ".go 47.629997 -155.270004 -2.714379 429",
    },
    ["Калимдор Рейды"] = {
      ["Логово Ониксии"] = ".go 29.454847 -68.960884 -6.984023 249",
      ["Руины Ан\'Киража"] = ".go -8429.743164 1512.136475 31.907234 509",
      ["Ан\'Кираж"] = ".go -8231.330078 2010.599976 129.330505 531",
    },

  }
elseif cont == "EK" then
  return {
    ["Восточные королевства Столицы"] = {
      ["Луносвет"] = ".go 9885.69 -7182.04 31.0402 530",
      ["Подгород"] = ".go 1586.48 239.562 -52.149 0",
      ["Стальгорн"] = ".go -4981.25 -881.542 501.66 0",
      ["Штормград"] = ".go -8913.23 554.633 94.7944 0",
    },
    ["Восточные королевства Территории"] = {
      ["Остров Кель\'Данас"] = ".go 12699.45 -6730.75 3.51 530",
    	["Леса Вечной Песни"] = ".go 8748.17 -7078.31 37.276 530",
    	["Призрачные земли"] = ".go 7579.28 -6822.69 86.5291 530",
    	["Восточные Чумные земли"] = ".go 2545.236328 -4773.797852 107.254280 0",
    	["Западные Чумные земли"] = ".go 1487.77 -1884.87 59.2039 0",
    	["Тирисфальские леса"] = ".go 2260.64 289.021 34.1291 0",
    	["Внутренние земли"] = ".go 369.041779 -3790.741699 171.096252 0",
    	["Предгорья Хилсбрада"] = ".go -28.1484 -899.243 56.0704 0",
    	["Серебряный бор"] = ".go 507.784 1611.33 124.921 0",
    	["Нагорье Арати"] = ".go -1262.79 -2521.75 20.8021 0",
    	["Руины Гилнеаса"] = ".go -1604.33 1892.72 15.6232 0",
    	["Сумеречное нагорье"] = ".go -3820.76 -5156.39 43.8867 0",
    	["Болотина"] = ".go -3522.96 -1848.58 25.1502 0",
    	["Лок Модан"] = ".go -5346.463379 -2973.036133 324.246033 0",
    	["Дун Морог"] = ".go -5582.32 -463.982 402 0",
    	["Вайш\'ир"] = ".go -5297.44 4393.02 5.90948 0",
    	["Бесплодные земли"] = ".go -6380.77 -3139.89 301.111 0",
    	["Тлеющее ущелье"] = ".go -6888.953125 -1336.459961 239.923050 0",
    	["Пылающие степи"] = ".go -7798.315430 -2171.406.go 6908 -4138 200 1982 133.010.437 0",
    	["Красногорье"] = ".go -9385.46 -3039.27 139.437 0",
    	["Элвиннский лес"] = ".go -9443.45 59.8944 56.0704 0",
    	["Болото Печали"] = ".go -10452.5 -3263.59 20.1782 0",
    	["Перевал Мертвого Ветра"] = ".go -10889.762695 -2291.202637 117.131104 0",
    	["Сумеречный лес"] = ".go -11105.4 -500.791 32.8518 0",
    	["Западный край"] = ".go -10644.8 1681.3 42.0338 0",
    	["Выжженные земли"] = ".go -11528.205078 -2863.730713 9.992482 0",
		["Мыс Тернистой долины"] = ".go -13754.2 168.246 23.9823 0",
		["Северная Тернистая долина"] = ".go -12245.5 -364.671 14.4018 0",
    },
    ["Восточные королевства Подземелья"] = {
      ["Мертвые копи"] = ".go -16.40 -383.07 61.78 36",
      ["Крепость Темного Клыка"] = ".go -228.19 2110.56 76.89 33",
      ["Тюрьма"] = ".go 49.821239 0.870144 -16.713627 34",
      ["Гномреган"] = ".go -337.437408 -0.258742 -152.845917 90",
      ["Залы Алого ордена"] = ".go 820 607 14 1001",
      ["Монастырь Алого ордена"] = ".go 1124 519 1 1004",
      ["Ульдаман"] = ".go -228.192993 46.160198 -46.018631 70",
      ["Затонувший храм"] = ".go -328 95 -91 109",
      ["Глубины Черной горы"] = ".go 459.455994 27.085884 -70.655228 230",
      ["Пик Черной горы"] = ".go 79.99 -233.34 52.02 229",
      ["Некроситет"] = ".go 203 103 132 1007",
      ["Стратхольм"] = ".go 3593.15 -3646.56 138.50 329",
    },
    ["Восточные королевства Рейды"] = {
      ["Огненные Недра"] = ".go 1071.902954 -488.489014 -108.219124 409",
      ["Логово Крыла Тьмы"] = ".go -7653.554688 -1093.969116 404.183105 469",
    },

  }
elseif cont == "OUTL" then
  return {
    ["Запределье Столицы"] = {
      ["Шаттрат"] = ".go -1904 5312 5 530",
    },
    ["Запределье Территории"] = {
      ["Полуостров Адского Пламени"] = ".go -251 1040 55 530",
      ["Зангартопь"] = ".go 36 7102 25 530",
      ["Пустоверть"] = ".go 3161 3155 101 530",
	  ["Награнд"] = ".go -2144 7837 -10 530",
	  ["Долина Призрачной Луны"] = ".go -3563 561 15 530",
	  ["Лес Тероккар"] = ".go -2127 4213 7 530",
	  ["Острогорье"] = ".go 2384 6045 140 530",
    },
    ["Запределье Подземелья"] = {
      ["empty"] = ".go 10 20 30 0",
      ["empty"] = ".go 10 20 30 0",
      ["empty"] = ".go 10 20 30 0",
    },
    ["Запределье Рейды"] = {
      ["empty"] = ".go 10 20 30 0",
      ["empty"] = ".go 10 20 30 0",
      ["empty"] = ".go 10 20 30 0",
    },

  }
elseif cont == "NRTH" then
  return {
    ["Нордскол Столицы"] = {
      ["Даларан"] = ".go 5794 632 648 571",
    },
    ["Нордскол Территории"] = {
	  ["Лагерь Хротгара"] = ".go 9962 1064 20 571",
      ["Борейская тундра"] = ".go 2989 6489 80 571",
      ["Низина Шолазар"] = ".go 5570 5608 -90 571",
      ["Озеро Ледяных Оков"] = ".go 5036 2848 400 571",
	  ["Ледяная Корона"] = ".go 5975 2156 610 571",
	  ["Грозовая гряда"] = ".go 6935 -1651 815 571",
	  ["Драконий Погост"] = ".go 3604 1401 95 571",
	  ["Лес Хрустальной Песни"] = ".go 5290 -814 171 571",
	  ["Зул\'Драк"] = ".go 5573 -3231 375 571",
	  ["Седые холмы"] = ".go 3601 -2941 228 571",
	  ["Ревущий фьорд"] = ".go 2804 -4620 280 571",
    },
    ["Нордскол Подземелья"] = {
      ["empty"] = ".go 10 20 30 0",
      ["empty"] = ".go 10 20 30 0",
      ["empty"] = ".go 10 20 30 0",
    },
    ["Нордскол Рейды"] = {
      ["empty"] = ".go 10 20 30 0",
      ["empty"] = ".go 10 20 30 0",
      ["empty"] = ".go 10 20 30 0",
    },

 }
elseif cont == "MAEL" then
  return {
    ["Водоворот Столицы"] = {
      ["Кезан"] = ".go -7947 1834 7 648",
    },
    ["Водоворот Территории"] = {
      ["Водоворот"] = ".go 848 1058 -7 730",
      ["Затерянные острова"] = ".go 1091 2311 6 648",
    },
  }
elseif cont == "PANDA" then
  return {
    ["Пандария Столицы"] = {
      ["(Орда) Святилище Двух Лун"] = ".go 1605 918 471 870",
      ["(Альянс) Святилище Семи Звезд"] = ".go 882 295 505 870",
    },
    ["Пандария Территории"] = {
      ["Вечноцветущий дол"] = ".go 877 1625 356 870",
      ["Вершина Кунь-Лай"] = ".go 3568 1727 860 870",
      ["Нефритовый лес"] = ".go 1125 -2008 135 870",
	  ["Танлунские степи"] = ".go 1580 3921 230 870",
	  ["Долина Четырех Ветров"] = ".go -257 645 167 870",
	  ["Жуткие пустоши"] = ".go 205 3390 210 870",
	  ["Красарангские джунгли"] = ".go -1417 1732 11 870",
	  ["Вневременный остров"] = ".go -652 -4764 4 870",
    },
}
elseif cont == "DRA" then
  return {
    ["Дренор Столицы"] = {
      ["(Альянс) Преграда Ветров"] = ".go 3716 -3919 30 1116",
      ["(Орда) Копье Войны"] = ".go 5380 -4019 15 1116",
    },
    ["Дренор Территории"] = {
      ["Таладор"] = ".go 1780 2976 94 1116",
      ["Награнд"] = ".go 3410 7364 12 1116",
      ["Хребет Ледяного Огня"] = ".go 6021 2871 200 1116",
	  ["Горгронд"] = ".go 5319 1310 98 1116",
	  ["Танаанские джунгли"] = ".go 4063 -1928 28 1116",
	  ["Долина Призрачной Луны"] = ".go 583 -1790 28 1116",
	  ["Пики Арака"] = ".go -463 1859 43 1116",
	  ["Ашран"] = ".go 4531 -4157 15 1116",
    },
}
elseif cont == "BISLES" then
  return {
    ["Расколотые острова Столицы"] = {
      ["Даларан"] = ".go -849.908 4461.17 735.661 1220",
    },
    ["Расколотые острова Территории"] = {
      ["Сурамар"] = ".go 1708.83 4637.75 124.004 1220",
      ["Штормхейм"] = ".go 3854.78 2020.04 242.638 1220",
      ["Крутогорье"] = ".go 4492.69 4836.35 661.706 1220",
      ["Валь\'шара"] = ".go 2795.81 7279.47 21.6704 1220",
      ["Азсуна"] = ".go -218.95 5600.9 61.1105 1220",
      ["Расколотый берег"] = ".go -1306.66 1741.4 7.32331 1220",
      ["Око Азшары"] = ".go -3400 4827.46 27.829 1220",
    },
    ["Расколотые острова Подземелья"] = {
      ["Казематы Стражей"] = ".go 4184,49 -762,405 269,472 1493",
      ["Утесы Адской Пасти"] = ".go 7184,29 7318,97 23,273 1492",
      ["Аметистовая крепость"] = ".go 4583,09 3999,98 83,4636 1544",
      ["Логово Нелтариона"] = ".go 2957,54  996,523 368,702 1458",
      ["Око Азшары"] = ".go -3914,34 4540,62 87,5838 1456",
      ["Чаща Темного Сердца"] = ".go 3240,72 1827,46 236,213 1466",
      ["Чертоги Доблести"] = ".go 3798,38 528,87 604,24 1477",
      ["Собор Вечной Ночи"] = ".go -699,75 2528,56 332,08 1677",
      ["Квартал Звезд"] = ".go 1016,07 3819,52 5,46093 1571",
      ["Каражан"] = ".go -11041,3 -1996,14 96,0049 1651",
      ["Престол Триумвирата"] = ".go 5424,53 10818,1 20,6352 1753",
      ["Катакомбы Сурамара"] = ".go 3515,74 4805,38 590,422 1516",
      ["Крепость Черной Ладьи"] = "",
    },
    ["Расколотые острова Рейды"] = {
      ["Изумрудный Кошмар"] = "",
      ["Испытание доблести"] = ".go 3200,6 529,077 633,631 1648",
      ["Цитадель Ночи"] = ".go -149,189 3531,72 -253,876 1530",
      ["Гробница Саргераса"] = ".go 5859,02 -795,786 2953,09  1676",
      ["Анторус "] = "",
    },
     ["Классовые оплоты"] = {
      ["Чернокнижник"] = ".go 3094.91 1062.63 242.58 1107",
      ["Охотник на демонов"] = ".go 1561.02 1399.94 237.108 1519",
      ["Шаман"] = ".go 1126.24 1069.48 3.55888 1469",
      ["Друид"] = ".go 4113.75 7459.81 48.2315 1220",
      ["Охотник"] = ".go 4529.88 5246.98 862.193 1220",
      ["Паладин"] = ".go 2373.48 -5356.95 52.5833 0",
      ["Разбойник"] = ".go -927.239 4501.06 700.75 1220",
      ["Рыцарь смерти"] = ".go -1502.45 1060.68 260.416 1220",
      ["Воин"] = ".go 1028.47 7225.17 100.181 1479",
      ["Монах"] = ".go 885.306 3605.37 192.23 1514",
      ["Маг"] = ".go -844 4759 918 1513",
      ["Жрец"] = ".go 1251,91 1344,2 185,017 1512",
    },
    ["Аргус"] = {
      ["Крокуун"] = ".go 990,983 1701,35 517,718 1669",
      ["Пустоши Анторуса"] = ".go -2926,61 8796,97 -232,111 1669",
      ["Мак\'Ари"] = ".go 4971,76 9819,18 -79,2215 1669",
    },
    ["Cоюзные расы Спавн"] = {
      ["Эльфы Бездны"] = ".go 2121 3318 54.7061 1865",
      ["Ночнорожденные"] = ".go 288.381 3352.23 145.444 1220",
      ["Озаренные дренеи"] = ".go 458.823 1449.61 757.573 1860",
      ["Таурены Крутогорья"] = ".go 4070 4385 671 1220",
    },
}

 elseif cont == "OT" then
  return {
  ["Другое"] = {
    ["Остров ГМ"] = ".go 16222.1 16252.1 12.5872 1",
    ["Обугленная пещера"] = ".go -7347 -642 294.586121 0",
    ["Логово Крыла Тьмы Cнаружи"] = ".go -7394.303711 -1074.987549 589.391235 469",
    ["Мертвые копи Странное место"] = ".go -1464.339 500.941 0.000 36",
    ["Подземный поезд Ныряльщик"] = ".go 78.911476 1167.338257 -106.266212 369",
    ["Высадка Ньюмена"] = ".go -6379.61 1260.49 7.18831 0",
    ["Укрытие Ортелла"] = ".go  -5314 -2512 484.233185 0",
    ["Наксрамас Cнаружи"] = ".go 3598 -4523 198.864639 533",
  },
  ["Тюрьма"] = {
    ["Альянса"] = ".go -98.0155 149.8360 -40.3827 35",
    ["Орды"] = ".go -11139.1845 -1742.4421 -29.7365 0",
    ["Официальная"] = ".go 16228.170898 16403.404297 -63.895161 1",
  },

}
 end
end
